src/InformationRegisters/ЗначенияДополнительныхПравПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхПравПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПраваПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Право</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПраваПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЗначенияДополнительныхПравПользователя/Forms/ФормаРедактированияПрав/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
// Процедура, обработчик события ПриСозданииНаСервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПользовательГруппа = ПараметрыСеанса.ТекущийПользователь;
	ЗаполнитьДеревоПрав();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события ПередЗакрытием
//
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность = Истина Тогда 
		Отказ = Истина;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект, Новый Структура("Отказ", Отказ)), "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьПрава(); 
	КонецЕсли;
	
	Если РезультатВопроса <> КодВозвратаДиалога.Отмена Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Проедура, обработчик события ПриИзменении
//
Процедура ДеревоПравЗначениеПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Проедура, обработчик события ПриИзменении
//
Процедура ПользовательГруппаПриИзменении(Элемент)
	
	Если ПользовательГруппа <> Неопределено И ПользовательГруппа.Пустая() = Ложь Тогда
		ЗаполнитьДеревоПрав();
		ОбщегоНазначенияКлиентСтоматология.РазвернутьДерево(Элементы.ДеревоПрав, ДеревоПрав);
	Иначе
		ЗаполнитьДеревоПрав();
		ДеревоПрав.ПолучитьЭлементы().Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательГруппаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если Модифицированность = Истина и ТипЗнч(ВыбранноеЗначение) <> Тип("Тип") Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОСохраненииИзменений", ЭтотОбъект,Новый Структура("НовоеЗначение",ВыбранноеЗначение)), "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик очистки Пользователь.
// 
Процедура ПользовательГруппаОчистка(Элемент, СтандартнаяОбработка)

	Если Модифицированность = Истина Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеВопросаОСохраненииИзменений", ЭтотОбъект,Новый Структура("НовоеЗначение",Неопределено)), "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНет);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОСохраненииИзменений(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	НовоеЗначение = ДополнительныеПараметры.НовоеЗначение;
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаписатьПрава();
	КонецЕсли;
	
	Если РезультатВопроса <> КодВозвратаДиалога.Отмена Тогда 
		ЭтотОбъект.ПользовательГруппа = НовоеЗначение; 
		ПользовательГруппаПриИзменении(Неопределено);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды Записать
//
Процедура Записать(Команда)
	
	ЗаписатьПрава();
	 
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды СнятьПометки
//
Процедура СнятьПометки(Команда)
	
	УстановитьПометкиСтрокДерева(ДеревоПрав, Ложь);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды ВыделитьВсе
//
Процедура ВыделитьВсе(Команда)
	
	УстановитьПометкиСтрокДерева(ДеревоПрав, Истина);
	Модифицированность = Истина;
	
КонецПроцедуры


#КонецОбласти  

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
// Процедура иерархически устанавливает пометку в дереве значений
//
Процедура УстановитьПометкиСтрокДерева(ЭлементДерева, Значение)
	
	Для Каждого СтрокаДерева Из ЭлементДерева.ПолучитьЭлементы() Цикл
		Если СтрокаДерева.ПолучитьЭлементы().Количество() > 0 Тогда
			УстановитьПометкиСтрокДерева(СтрокаДерева, Значение);
		Иначе
			СтрокаДерева.Значение = Значение;
		КонецЕсли;
	КонецЦикла

КонецПроцедуры

&НаСервере
// Процедура выгружает строки с иерархией в таблицу значений
//
Процедура ВыгрузитьДеревоВТаблицуЗначений(ЭлементДерева, НаборЗаписей)
	
	Для Каждого СтрокаДерева Из ЭлементДерева.ПолучитьЭлементы() Цикл
		Если НЕ СтрокаДерева.ИндексКартинки = 0 И СтрокаДерева.Значение = Истина Тогда
			НоваяСтрока = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаДерева);
		Иначе
			ВыгрузитьДеревоВТаблицуЗначений(СтрокаДерева, НаборЗаписей);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Процедура считывает данные о правах из регистра
//
Процедура ЗаполнитьДеревоПрав()
	
	ДеревоПрав.ПолучитьЭлементы().Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	&Пользователь КАК Пользователь,
	|	Права.Ссылка КАК Право,
	|	ЗначениеПрав.Значение КАК Значение,
	|	ВЫБОР
	|		КОГДА Права.ЭтоГруппа
	|			ТОГДА 0
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК ИндексКартинки
	|ИЗ
	|	ПланВидовХарактеристик.ПраваПользователей КАК Права
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхПравПользователя КАК ЗначениеПрав
	|		ПО (ЗначениеПрав.Пользователь = &Пользователь)
	|			И (ЗначениеПрав.Право = Права.Ссылка)
	|ГДЕ
	|	НЕ Права.Ссылка.ПометкаУдаления
	|	И Права.Ссылка <> ЗНАЧЕНИЕ(ПланВидовХарактеристик.ПраваПользователей.ЗапрашиватьПодтверждениеПриЗакрытии)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Права.Ссылка ИЕРАРХИЯ,
	|	Права.Наименование");
	
	Запрос.УстановитьПараметр("Пользователь", ПользовательГруппа);
	ВыборкаДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ЗначениеВРеквизитФормы(ВыборкаДерево, "ДеревоПрав");
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
// Процедура записывает данные о разрешенных правах в регистр
//
Процедура ЗаписатьПрава()
	
	Набор = РегистрыСведений.ЗначенияДополнительныхПравПользователя.СоздатьНаборЗаписей();
	
	Набор.Отбор.Пользователь.Использование = Истина;
	Набор.Отбор.Пользователь.Значение = ПользовательГруппа;
	ВыгрузитьДеревоВТаблицуЗначений(ДеревоПрав, Набор);
	
	Набор.Записать();
	Модифицированность = Ложь;
	
КонецПроцедуры 



#КонецОбласти
